# Intro to Data Structures
https://pandas.pydata.org/pandas-docs/stable/dsintro.html

In [1]:
import numpy as np
import pandas as pd

## Series

Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index.

In [2]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    0.337062
b    1.038739
c   -0.931932
d   -0.291651
e   -0.210281
dtype: float64

In [3]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [4]:
pd.Series(np.random.randn(5))

0   -0.820016
1    1.042221
2   -0.050387
3   -0.239851
4   -0.779401
dtype: float64

In [5]:
#From a dict

d = {'a' : 0., 'b' : 1., 'c' : 2.}
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [6]:
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [7]:
#From scalar value 
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [8]:
#Series is ndarray-like
s[0]

0.3370619135210377

In [9]:
s[:3]

a    0.337062
b    1.038739
c   -0.931932
dtype: float64

In [10]:
s[s > s.median()]

a    0.337062
b    1.038739
dtype: float64

In [11]:
s[[4, 3, 1]]

e   -0.210281
d   -0.291651
b    1.038739
dtype: float64

In [12]:
np.exp(s)

a    1.400826
b    2.825651
c    0.393792
d    0.747029
e    0.810357
dtype: float64

In [13]:
#Series is dict-like
s['a']

0.3370619135210377

In [14]:
s['e'] = 12.
s

a     0.337062
b     1.038739
c    -0.931932
d    -0.291651
e    12.000000
dtype: float64

In [15]:
'e' in s

True

In [16]:
'f' in s

False

In [17]:
s.get('f', np.nan)

nan

In [18]:
#Vectorized operations and label alignment with Series
s = pd.Series(np.random.randn(5))
s

0   -0.153118
1   -0.158712
2   -0.249644
3    0.406865
4   -0.069518
dtype: float64

In [19]:
s + s

0   -0.306235
1   -0.317424
2   -0.499287
3    0.813729
4   -0.139037
dtype: float64

In [20]:
s * 2

0   -0.306235
1   -0.317424
2   -0.499287
3    0.813729
4   -0.139037
dtype: float64

In [21]:
np.exp(s)

0    0.858029
1    0.853242
2    0.779078
3    1.502101
4    0.932843
dtype: float64

In [22]:
#Operations between Series automatically align the data based on label (Not for position)
# If one label doesn't have value in each Serie, the operation returns NaN
s[1:] + s[:-1]

0         NaN
1   -0.317424
2   -0.499287
3    0.813729
4         NaN
dtype: float64

In [23]:
#Name attribute
s = pd.Series(np.random.randn(5), name='something')
s

0    0.628898
1    0.422323
2    0.164728
3    0.896829
4    0.265410
Name: something, dtype: float64

In [24]:
s.name

'something'

In [25]:
#Rename serie
s2 = s.rename("different")
s2

0    0.628898
1    0.422323
2    0.164728
3    0.896829
4    0.265410
Name: different, dtype: float64

## DataFrame
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects

Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments.

In [26]:
#From dict of Series or dicts
d = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
d

{'one': a    1.0
 b    2.0
 c    3.0
 dtype: float64, 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [27]:
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [28]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [29]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [30]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [31]:
df.columns

Index(['one', 'two'], dtype='object')

In [32]:
#From dict of ndarrays / lists
d = {'one' : [1., 2., 3., 4.],
     'two' : [4., 3., 2., 1.]}
d

{'one': [1.0, 2.0, 3.0, 4.0], 'two': [4.0, 3.0, 2.0, 1.0]}

In [33]:
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [34]:
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [35]:
#From structured or record array
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
data

array([(0, 0.0, b''), (0, 0.0, b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [36]:
data[:] = [(1,2.,'Hello'), (2,3.,"World")]
data

array([(1, 2.0, b'Hello'), (2, 3.0, b'World')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [37]:
pd.DataFrame(data)

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [38]:
pd.DataFrame(data, index=['first', 'second'])

        A    B         C
first   1  2.0  b'Hello'
second  2  3.0  b'World'

In [39]:
pd.DataFrame(data, columns=['C', 'A', 'B'])

          C  A    B
0  b'Hello'  1  2.0
1  b'World'  2  3.0

In [40]:
#From a list of dicts
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
data2

[{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

In [41]:
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [42]:
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [43]:
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

In [44]:
#From a dict of tuples
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
              ('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
              ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
              ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
              ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

       a              b
       a    b    c    a     b
A B  4.0  1.0  5.0  8.0  10.0
  C  3.0  2.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [45]:
#Alternate Constructors
data

array([(1, 2.0, b'Hello'), (2, 3.0, b'World')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [46]:
pd.DataFrame.from_records(data, index='C')

          A    B
C
b'Hello'  1  2.0
b'World'  2  3.0

In [47]:
pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])])

   A  B
0  1  4
1  2  5
2  3  6

In [48]:
pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])],orient='index', columns=['one', 'two', 'three'])

   one  two  three
A    1    2      3
B    4    5      6

In [51]:
#Column selection, addition, deletion
df['flag'] = df['one'] > 2
df

   one  two   flag
a  1.0  1.0  False
b  2.0  2.0  False
c  3.0  3.0   True
d  NaN  4.0  False

In [53]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [54]:
df['three'] = df['one'] * df['two']
df

   one  two   flag  three
a  1.0  1.0  False    1.0
b  2.0  2.0  False    4.0
c  3.0  3.0   True    9.0
d  NaN  4.0  False    NaN

In [55]:
df['flag'] = df['one'] > 2
df

   one  two   flag  three
a  1.0  1.0  False    1.0
b  2.0  2.0  False    4.0
c  3.0  3.0   True    9.0
d  NaN  4.0  False    NaN

In [56]:
#Delete column
del df['two']
df

   one   flag  three
a  1.0  False    1.0
b  2.0  False    4.0
c  3.0   True    9.0
d  NaN  False    NaN

In [57]:
three = df.pop('three')
three

a    1.0
b    4.0
c    9.0
d    NaN
Name: three, dtype: float64

In [58]:
df

   one   flag
a  1.0  False
b  2.0  False
c  3.0   True
d  NaN  False

In [59]:
df['foo'] = 'bar'
df

   one   flag  foo
a  1.0  False  bar
b  2.0  False  bar
c  3.0   True  bar
d  NaN  False  bar

In [60]:
df['one_trunc'] = df['one'][:2]
df

   one   flag  foo  one_trunc
a  1.0  False  bar        1.0
b  2.0  False  bar        2.0
c  3.0   True  bar        NaN
d  NaN  False  bar        NaN

In [61]:
df.insert(1, 'bar', df['one'])
df

   one  bar   flag  foo  one_trunc
a  1.0  1.0  False  bar        1.0
b  2.0  2.0  False  bar        2.0
c  3.0  3.0   True  bar        NaN
d  NaN  NaN  False  bar        NaN

In [65]:
#Assigning New Columns in Method Chains
iris = pd.read_csv('../files/iris.data')
iris.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa

In [66]:
(iris.assign(sepal_ratio = iris['SepalWidth'] / iris['SepalLength']).head())

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name  sepal_ratio
0          5.1         3.5          1.4         0.2  Iris-setosa     0.686275
1          4.9         3.0          1.4         0.2  Iris-setosa     0.612245
2          4.7         3.2          1.3         0.2  Iris-setosa     0.680851
3          4.6         3.1          1.5         0.2  Iris-setosa     0.673913
4          5.0         3.6          1.4         0.2  Iris-setosa     0.720000

In [67]:
iris.assign(sepal_ratio = lambda x: (x['SepalWidth'] / x['SepalLength'])).head()

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name  sepal_ratio
0          5.1         3.5          1.4         0.2  Iris-setosa     0.686275
1          4.9         3.0          1.4         0.2  Iris-setosa     0.612245
2          4.7         3.2          1.3         0.2  Iris-setosa     0.680851
3          4.6         3.1          1.5         0.2  Iris-setosa     0.673913
4          5.0         3.6          1.4         0.2  Iris-setosa     0.720000

In [69]:
(iris.query('SepalLength > 5')
.assign(SepalRatio = lambda x: x.SepalWidth / x.SepalLength
        ,PetalRatio = lambda x: x.PetalWidth / x.PetalLength)
 .plot(kind='scatter', x='SepalRatio', y='PetalRatio'))

In [70]:
#Indexing / Selection
df

   one  bar   flag  foo  one_trunc
a  1.0  1.0  False  bar        1.0
b  2.0  2.0  False  bar        2.0
c  3.0  3.0   True  bar        NaN
d  NaN  NaN  False  bar        NaN

In [72]:
# Select column: df[col] ==> Series
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [74]:
#Select row by label: df.loc[label] ==> Series
df.loc['b']

one              2
bar              2
flag         False
foo            bar
one_trunc        2
Name: b, dtype: object

In [75]:
#Select row by integer location: df.iloc[loc] ==> Series
df.iloc[2]

one             3
bar             3
flag         True
foo           bar
one_trunc     NaN
Name: c, dtype: object

In [76]:
#Slice rows: df[5:10] ==> DataFrame
df[1:3]

   one  bar   flag  foo  one_trunc
b  2.0  2.0  False  bar        2.0
c  3.0  3.0   True  bar        NaN

In [79]:
#Select rows by boolean vector: df[bool_vec] ==> DataFrame
df[[False,True,True,False]]

   one  bar   flag  foo  one_trunc
b  2.0  2.0  False  bar        2.0
c  3.0  3.0   True  bar        NaN

In [81]:
#Data alignment and arithmetic
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  1.388300 -0.557390  0.939028  0.373704
1  1.135673 -0.083620 -0.715492  1.104049
2  0.660569 -1.181487  1.311830 -1.078282
3  0.022639 -0.090022 -1.463242  0.632892
4 -1.756491  1.015520  1.115693 -2.667645
5 -0.856511  1.415929  1.177264 -0.883002
6 -0.225961 -1.556934  0.142676 -1.643993
7  0.574071  0.912964  1.543834 -0.986787
8  0.890934  0.693463 -2.479745  1.042842
9 -1.219861  1.039418  0.690350  0.651039

In [82]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])
df2

          A         B         C
0 -0.136428  0.501009  1.681462
1 -0.744342  1.845359 -0.732660
2 -0.622178 -1.075561 -0.623121
3  0.845775 -0.589538  0.246859
4  2.428367 -0.576309  1.656607
5 -0.643044 -2.129173 -0.573792
6  0.616512  0.035500 -0.660079

In [83]:
df + df2

          A         B         C   D
0  1.251873 -0.056381  2.620491 NaN
1  0.391331  1.761738 -1.448152 NaN
2  0.038392 -2.257048  0.688709 NaN
3  0.868414 -0.679560 -1.216383 NaN
4  0.671875  0.439211  2.772300 NaN
5 -1.499555 -0.713244  0.603473 NaN
6  0.390551 -1.521434 -0.517404 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [84]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -0.252628  0.473770 -1.654520  0.730345
2 -0.727731 -0.624096  0.372801 -1.451986
3 -1.365661  0.467368 -2.402270  0.259187
4 -3.144792  1.572910  0.176664 -3.041349
5 -2.244812  1.973319  0.238236 -1.256706
6 -1.614261 -0.999544 -0.796353 -2.017697
7 -0.814229  1.470355  0.604806 -1.360491
8 -0.497366  1.250853 -3.418774  0.669138
9 -2.608161  1.596808 -0.248678  0.277335

In [85]:
index = pd.date_range('1/1/2000', periods=8)
index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [86]:
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=list('ABC'))
df

                   A         B         C
2000-01-01  0.155477  1.194408 -0.136439
2000-01-02 -1.809752  1.340046  1.101628
2000-01-03 -1.585783 -0.033436  1.284236
2000-01-04  0.018606  0.143577 -1.278076
2000-01-05 -0.408728 -0.782694  0.380166
2000-01-06  0.140995  1.012655 -1.021252
2000-01-07 -1.584333 -1.508318  0.441465
2000-01-08  1.229434 -0.251935 -0.399260

In [87]:
type(df['A'])

pandas.core.series.Series

In [89]:
df.sub(df['A'], axis=0)

              A         B         C
2000-01-01  0.0  1.038931 -0.291916
2000-01-02  0.0  3.149797  2.911380
2000-01-03  0.0  1.552347  2.870019
2000-01-04  0.0  0.124971 -1.296682
2000-01-05  0.0 -0.373966  0.788894
2000-01-06  0.0  0.871660 -1.162247
2000-01-07  0.0  0.076014  2.025798
2000-01-08  0.0 -1.481369 -1.628694

In [90]:
#Operations with scalars 
df * 5 + 2

                   A         B         C
2000-01-01  2.777384  7.972040  1.317803
2000-01-02 -7.048760  8.700228  7.508138
2000-01-03 -5.928917  1.832818  8.421179
2000-01-04  2.093030  2.717883 -4.390378
2000-01-05 -0.043642 -1.913470  3.900830
2000-01-06  2.704977  7.063276 -3.106260
2000-01-07 -5.921664 -5.541592  4.207325
2000-01-08  8.147172  0.740325  0.003701

In [91]:
1 / df

                    A          B         C
2000-01-01   6.431832   0.837235 -7.329257
2000-01-02  -0.552562   0.746243  0.907748
2000-01-03  -0.630603 -29.907446  0.778673
2000-01-04  53.746198   6.964923 -0.782426
2000-01-05  -2.446612  -1.277638  2.630429
2000-01-06   7.092432   0.987503 -0.979190
2000-01-07  -0.631181  -0.662990  2.265185
2000-01-08   0.813382  -3.969277 -2.504635

In [92]:
df ** 4

                       A         B         C
2000-01-01  5.843342e-04  2.035217  0.000347
2000-01-02  1.072695e+01  3.224617  1.472785
2000-01-03  6.323761e+00  0.000001  2.720064
2000-01-04  1.198420e-07  0.000425  2.668248
2000-01-05  2.790869e-02  0.375291  0.020888
2000-01-06  3.952021e-04  1.051590  1.087757
2000-01-07  6.300654e+00  5.175736  0.037983
2000-01-08  2.284659e+00  0.004029  0.025411

In [93]:
#Boolean operators
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)
df1

       a      b
0   True  False
1  False   True
2   True   True

In [94]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)
df2

       a      b
0  False   True
1   True   True
2   True  False

In [95]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [96]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [97]:
df1 ^ df2

       a      b
0   True   True
1   True  False
2  False   True

In [98]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

In [99]:
#Transposing
# only show the first 5 rows
df[:5].T

   2000-01-01  2000-01-02  2000-01-03  2000-01-04  2000-01-05
A    0.155477   -1.809752   -1.585783    0.018606   -0.408728
B    1.194408    1.340046   -0.033436    0.143577   -0.782694
C   -0.136439    1.101628    1.284236   -1.278076    0.380166

In [100]:
#DataFrame interoperability with NumPy functions
np.exp(df)

                   A         B         C
2000-01-01  1.168215  3.301603  0.872459
2000-01-02  0.163695  3.819217  3.009060
2000-01-03  0.204787  0.967116  3.611907
2000-01-04  1.018780  1.154395  0.278573
2000-01-05  0.664495  0.457173  1.462527
2000-01-06  1.151419  2.752901  0.360144
2000-01-07  0.205085  0.221282  1.554984
2000-01-08  3.419295  0.777295  0.670816

In [101]:
np.asarray(df)

array([[ 0.15547671,  1.19440797, -0.13643948],
       [-1.80975193,  1.34004551,  1.10162761],
       [-1.58578336, -0.03343649,  1.28423577],
       [ 0.01860597,  0.14357661, -1.27807559],
       [-0.40872843, -0.78269403,  0.38016606],
       [ 0.14099536,  1.01265523, -1.02125206],
       [-1.58433278, -1.50831838,  0.4414651 ],
       [ 1.22943437, -0.25193503, -0.3992598 ]])

In [102]:
#The dot method on DataFrame implements matrix multiplication:
df.T.dot(df)

           A         B         C
A  10.022988  0.358877 -5.564853
B   0.358877  7.220641 -0.810188
C  -5.564853 -0.810188  6.056720

In [103]:
s1 = pd.Series(np.arange(5,10))
s1

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [104]:
s1.dot(s1)

255

In [106]:
#Console display
baseball = pd.read_csv('../files/game_logs.csv')
print(baseball)

/home/kny/Software-Development/IDEs/anaconda3/envs/test_env/lib/python3.4/site-packages/IPython/core/interactiveshell.py:2728: DtypeWarning: Columns (12,13,14,15,19,20,81,83,85,87,93,94,95,96,97,98,99,100,105,106,108,109,111,112,114,115,117,118,120,121,123,124,126,127,129,130,132,133,135,136,138,139,141,142,144,145,147,148,150,151,153,154,156,157,160) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

            date  number_of_game day_of_week v_name v_league  v_game_number  \
0       18710504               0         Thu    CL1       na              1
1       18710505               0         Fri    BS1       na              1
2       18710506               0         Sat    CL1       na              2
3       18710508               0         Mon    CL1       na              3
4       18710509               0         Tue    BS1       na              2
5       18710511               0         Thu    CH1       na              2
6       18710513               0         Sat    WS3       na              2
7       18710513               0         Sat    CH1       na              3
8       18710515               0         Mon    WS3       na              3
9       18710516               0         Tue    TRO       na              2
10      18710516               0         Tue    WS3       na              4
11      18710517               0         Wed    WS3       na              5
12      18710518               0         Thu    NY2       na              1
13      18710519               0         Fri    WS3       na              6
14      18710520               0         Sat    PH1       na              1
15      18710520               0         Sat    WS3       na              7
16      18710522               0         Mon    RC1       na              3
17      18710522               0         Mon    WS3       na              8
18      18710523               0         Tue    RC1       na              4
19      18710524               0         Wed    WS3       na              9
20      18710524               0         Wed    RC1       na              5
21      18710525               0         Thu    TRO       na              5
22      18710526               0         Fri    RC1       na              6
23      18710526               0         Fri    FW1       na              5
24      18710527               0         Sat    WS3       na             10
25      18710529               0         Mon    RC1       na              7
26      18710530               0         Tue    RC1       na              8
27      18710601               0         Thu    RC1       na              9
28      18710602               0         Fri    CH1       na              7
29      18710602               0         Fri    TRO       na              7
...          ...             ...         ...    ...      ...            ...
171877  20161001               0         Sat    HOU       AL            161
171878  20161001               0         Sat    TOR       AL            161
171879  20161001               0         Sat    MIN       AL            161
171880  20161001               0         Sat    CLE       AL            160
171881  20161001               0         Sat    BAL       AL            161
171882  20161001               0         Sat    OAK       AL            161
171883  20161001               0         Sat    TBA       AL            161
171884  20161001               0         Sat    SDN       NL            161
171885  20161001               0         Sat    DET       AL            160
171886  20161001               0         Sat    CHN       NL            161
171887  20161001               0         Sat    MIL       NL            161
171888  20161001               0         Sat    NYN       NL            161
171889  20161001               0         Sat    LAN       NL            161
171890  20161001               0         Sat    PIT       NL            161
171891  20161001               0         Sat    MIA       NL            160
171892  20161002               0         Sun    HOU       AL            162
171893  20161002               0         Sun    TOR       AL            162
171894  20161002               0         Sun    MIN       AL            162
171895  20161002               0         Sun    CLE       AL            161
171896  20161002               0         Sun    BAL       AL            162
171897  20161002               0         Sun    OAK       AL            162
171898  20161002               0         Sun    TBA       AL            162
171899  20161002               0         Sun    SDN       NL            162
171900  20161002               0         Sun    DET       AL            161
171901  20161002               0         Sun    CHN       NL            162
171902  20161002               0         Sun    MIL       NL            162
171903  20161002               0         Sun    NYN       NL            162
171904  20161002               0         Sun    LAN       NL            162
171905  20161002               0         Sun    PIT       NL            162
171906  20161002               0         Sun    MIA       NL            161

       h_name h_league  h_game_number  v_score       ...         \
0         FW1       na              1        0       ...
1         WS3       na              1       20       ...
2         RC1       na              1       12       ...
3         CH1       na              1       12       ...
4         TRO       na              1        9       ...
5         CL1       na              4       18       ...
6         CL1       na              5       12       ...
7         FW1       na              2       14       ...
8         FW1       na              3        6       ...
9         BS1       na              3       29       ...
10        CH1       na              4        4       ...
11        RC1       na              2       12       ...
12        TRO       na              3       14       ...
13        CH1       na              5        7       ...
14        BS1       na              4        8       ...
15        CL1       na              6       13       ...
16        CH1       na              6        6       ...
17        TRO       na              4       14       ...
18        FW1       na              4       17       ...
19        BS1       na              5        4       ...
20        CL1       na              7       10       ...
21        NY2       na              2       25       ...
22        TRO       na              6       15       ...
23        CL1       na              8       16       ...
24        BS1       na              6        6       ...
25        BS1       na              7       11       ...
26        BS1       na              8       10       ...
27        NY2       na              3        3       ...
28        BS1       na              9       16       ...
29        WS3       na             11        8       ...
...       ...      ...            ...      ...       ...
171877    ANA       AL            161        3       ...
171878    BOS       AL            161        4       ...
171879    CHA       AL            161        6       ...
171880    KCA       AL            161        6       ...
171881    NYA       AL            161        3       ...
171882    SEA       AL            161        9       ...
171883    TEX       AL            161        4       ...
171884    ARI       NL            161        5       ...
171885    ATL       NL            160        3       ...
171886    CIN       NL            161        4       ...
171887    COL       NL            161        4       ...
171888    PHI       NL            161        5       ...
171889    SFN       NL            161        0       ...
171890    SLN       NL            161        3       ...
171891    WAS       NL            161        1       ...
171892    ANA       AL            162        1       ...
171893    BOS       AL            162        2       ...
171894    CHA       AL            162        6       ...
171895    KCA       AL            162        3       ...
171896    NYA       AL            162        5       ...
171897    SEA       AL            162        3       ...
171898    TEX       AL            162        6       ...
171899    ARI       NL            162        2       ...
171900    ATL       NL            161        0       ...
171901    CIN       NL            162        7       ...
171902    COL       NL            162        6       ...
171903    PHI       NL            162        2       ...
171904    SFN       NL            162        1       ...
171905    SLN       NL            162        4       ...
171906    WAS       NL            162        7       ...

         h_player_7_name  h_player_7_def_pos h_player_8_id   h_player_8_name  \
0             Ed Mincher                 7.0      mcdej101   James McDermott
1           Asa Brainard                 1.0      burrh101   Henry Burroughs
2             Pony Sager                 6.0      birdg101       George Bird
3               Ed Duffy                 6.0      pinke101        Ed Pinkham
4           Steve Bellan                 5.0      pikel101          Lip Pike
5            Ezra Sutton                 5.0      carlj102      Jim Carleton
6            Ezra Sutton                 5.0      white104       Elmer White
7             Ed Mincher                 7.0      donnp101     Pete Donnelly
8             Ed Mincher                 7.0      donnp101     Pete Donnelly
9              Fred Cone                 7.0      spala101       Al Spalding
10              Ed Duffy                 6.0      pinke101        Ed Pinkham
11             Cap Anson                 2.0      sagep101        Pony Sager
12          Steve Bellan                 5.0      pikel101          Lip Pike
13              Ed Duffy                 6.0      pinke101        Ed Pinkham
14         Harry Schafer                 5.0      conef101         Fred Cone
15           Ezra Sutton                 5.0      johnc105   William Johnson
16              Ed Duffy                 6.0      pinke101        Ed Pinkham
17          Steve Bellan                 5.0      pikel101          Lip Pike
18            Ed Mincher                 7.0      donnp101     Pete Donnelly
19         Harry Schafer                 5.0      conef101         Fred Cone
20           Ezra Sutton                 5.0      johnc105   William Johnson
21           Dave Eggler                 8.0      woltr101     Rynie Wolters
22          Steve Bellan                 5.0      connn101        Ned Connor
23           Ezra Sutton                 5.0      johnc105   William Johnson
24         Harry Schafer                 5.0      conef101         Fred Cone
25         Harry Schafer                 5.0      conef101         Fred Cone
26         Harry Schafer                 5.0      barrf102     Frank Barrows
27           Dave Eggler                 8.0      woltr101     Rynie Wolters
28             Fred Cone                 7.0      spala101       Al Spalding
29          Asa Brainard                 1.0      hallg101       George Hall
...                  ...                 ...           ...               ...
171877     Rafael Ortega                 8.0      gratj001     Juan Graterol
171878    Jackie Bradley                 8.0      hilla001        Aaron Hill
171879    Yolmer Sanchez                 4.0      narvo001      Omar Narvaez
171880       Daniel Nava                 3.0      cuthc001  Cheslor Cuthbert
171881     Austin Romine                 2.0      austt001      Tyler Austin
171882     Leonys Martin                 8.0      zunim001       Mike Zunino
171883  Jurickson Profar                 6.0      gallj002        Joey Gallo
171884         Jake Lamb                 5.0      herno002   Oscar Hernandez
171885     Jace Peterson                 4.0      swand001    Dansby Swanson
171886  Patrick Kivlehan                 9.0      cabrr001     Ramon Cabrera
171887  Cristhian Adames                 6.0      woltt001      Tony Wolters
171888     Jimmy Paredes                 7.0      altha001     Aaron Altherr
171889    Gordon Beckham                 5.0      panij002         Joe Panik
171890       Jedd Gyorko                 4.0      gricr001    Randal Grichuk
171891    Pedro Severino                 2.0      espid001    Danny Espinosa
171892     Rafael Ortega                 8.0      perec003      Carlos Perez
171893    Jackie Bradley                 8.0      leons001        Sandy Leon
171894        Alex Avila                 2.0      sancc001    Yolmer Sanchez
171895   Alcides Escobar                 6.0      cuthc001  Cheslor Cuthbert
171896       Aaron Hicks                 9.0      torrr001   Ronald Torreyes
171897         Ben Gamel                 7.0      iannc001    Chris Iannetta
171898      Elvis Andrus                 6.0      rua-r001          Ryan Rua
171899     Mitch Haniger                 8.0      goset001   Tuffy Gosewisch
171900     Jace Peterson                 4.0      swand001    Dansby Swanson
171901   Tucker Barnhart                 2.0      rendt001        Tony Renda
171902       Pat Valaika                 4.0      adamc001  Cristhian Adames
171903     Andres Blanco                 6.0      altha001     Aaron Altherr
171904         Joe Panik                 4.0      gillc001   Conor Gillaspie
171905       Jedd Gyorko                 4.0      gricr001    Randal Grichuk
171906    Danny Espinosa                 6.0      lobaj001      Jose Lobaton

       h_player_8_def_pos h_player_9_id    h_player_9_name  \
0                     8.0      kellb105         Bill Kelly
1                     9.0      berth101    Henry Berthrong
2                     7.0      stirg101         Gat Stires
3                     5.0      zettg101    George Zettlein
4                     3.0      cravb101        Bill Craver
5                     3.0      bassj101          John Bass
6                     9.0      bassj101          John Bass
7                     8.0      kellb105         Bill Kelly
8                     9.0      kellb105         Bill Kelly
9                     1.0      jacks101        Sam Jackson
10                    5.0      zettg101    George Zettlein
11                    6.0      birdg101        George Bird
12                    3.0      cravb101        Bill Craver
13                    5.0      zettg101    George Zettlein
14                    7.0      spala101        Al Spalding
15                    9.0      bassj101          John Bass
16                    5.0      zettg101    George Zettlein
17                    3.0      cravb101        Bill Craver
18                    9.0      kellb105         Bill Kelly
19                    7.0      spala101        Al Spalding
20                    9.0      bassj101          John Bass
21                    1.0      pattd103      Tom Patterson
22                    3.0      cravb101        Bill Craver
23                    9.0      bassj101          John Bass
24                    7.0      spala101        Al Spalding
25                    7.0      spala101        Al Spalding
26                    7.0      spala101        Al Spalding
27                    1.0      pattd103      Tom Patterson
28                    1.0      jacks101        Sam Jackson
29                    8.0      berth101    Henry Berthrong
...                   ...           ...                ...
171877                2.0      cowak001       Kaleb Cowart
171878                5.0      vazqc001  Christian Vazquez
171879                2.0      garcl004       Leury Garcia
171880                5.0      buted001        Drew Butera
171881                9.0      torrr001    Ronald Torreyes
171882                2.0      martk001        Ketel Marte
171883                5.0      chirr001  Robinson Chirinos
171884                2.0      brada001     Archie Bradley
171885                6.0      blaia001        Aaron Blair
171886                2.0      adlet001        Tim Adleman
171887                2.0      hoffj003       Jeff Hoffman
171888                9.0      kleip001         Phil Klein
171889                4.0      blact002           Ty Blach
171890                8.0      wachm001      Michael Wacha
171891                6.0      roart001       Tanner Roark
171892                2.0      pennc001   Cliff Pennington
171893                2.0      benia002  Andrew Benintendi
171894                4.0      garcl004       Leury Garcia
171895                5.0      buted001        Drew Butera
171896                5.0      solad001     Donovan Solano
171897                2.0      freem002       Mike Freeman
171898                3.0      profj001   Jurickson Profar
171899                2.0      kochm001          Matt Koch
171900                6.0      tehej001      Julio Teheran
171901                9.0      stepr002  Robert Stephenson
171902                6.0      marqg001     German Marquez
171903                9.0      eickj001     Jerad Eickhoff
171904                5.0      moorm003         Matt Moore
171905                8.0      waina001    Adam Wainwright
171906                2.0      schem001       Max Scherzer

        h_player_9_def_pos  additional_info acquisition_info
0                      9.0              NaN                Y
1                      8.0             HTBF                Y
2                      9.0              NaN                Y
3                      1.0              NaN                Y
4                      6.0             HTBF                Y
5                      6.0              NaN                Y
6                      6.0              NaN                Y
7                      9.0              NaN                Y
8                      8.0              NaN                Y
9                      8.0             HTBF                Y
10                     1.0              NaN                Y
11                     8.0              NaN                Y
12                     6.0             HTBF                Y
13                     1.0             HTBF                Y
14                     1.0             HTBF                Y
15                     6.0             HTBF                Y
16                     1.0              NaN                Y
17                     6.0             HTBF                Y
18                     8.0             HTBF                Y
19                     1.0             HTBF                Y
20                     6.0              NaN                Y
21                     9.0              NaN                Y
22                     2.0              NaN                Y
23                     6.0             HTBF                Y
24                     1.0              NaN                Y
25                     1.0              NaN                Y
26                     1.0             HTBF                Y
27                     9.0             HTBF                Y
28                     4.0              NaN                Y
29                     7.0             HTBF                Y
...                    ...              ...              ...
171877                 4.0              NaN                Y
171878                 2.0              NaN                Y
171879                 8.0              NaN                Y
171880                 2.0              NaN                Y
171881                 6.0              NaN                Y
171882                 6.0              NaN                Y
171883                 2.0              NaN                Y
171884                 1.0              NaN                Y
171885                 1.0              NaN                Y
171886                 1.0              NaN                Y
171887                 1.0              NaN                Y
171888                 1.0              NaN                Y
171889                 1.0              NaN                Y
171890                 1.0              NaN                Y
171891                 1.0              NaN                Y
171892                 4.0              NaN                Y
171893                 7.0              NaN                Y
171894                 8.0              NaN                Y
171895                 2.0              NaN                Y
171896                 4.0              NaN                Y
171897                 4.0              NaN                Y
171898                 4.0              NaN                Y

In [107]:
baseball.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 171907 entries, 0 to 171906
Columns: 161 entries, date to acquisition_info
dtypes: float64(77), int64(6), object(78)
memory usage: 211.2+ MB

In [108]:
print(baseball.iloc[-20:, :12].to_string())

            date  number_of_game day_of_week v_name v_league  v_game_number h_name h_league  h_game_number  v_score  h_score  length_outs
171887  20161001               0         Sat    MIL       NL            161    COL       NL            161        4        3         60.0
171888  20161001               0         Sat    NYN       NL            161    PHI       NL            161        5        3         54.0
171889  20161001               0         Sat    LAN       NL            161    SFN       NL            161        0        3         51.0
171890  20161001               0         Sat    PIT       NL            161    SLN       NL            161        3        4         51.0
171891  20161001               0         Sat    MIA       NL            160    WAS       NL            161        1        2         51.0
171892  20161002               0         Sun    HOU       AL            162    ANA       AL            162        1        8         51.0
171893  20161002               0         Sun    TOR       AL            162    BOS       AL            162        2        1         54.0
171894  20161002               0         Sun    MIN       AL            162    CHA       AL            162        6        3         54.0
171895  20161002               0         Sun    CLE       AL            161    KCA       AL            162        3        2         54.0
171896  20161002               0         Sun    BAL       AL            162    NYA       AL            162        5        2         54.0
171897  20161002               0         Sun    OAK       AL            162    SEA       AL            162        3        2         54.0
171898  20161002               0         Sun    TBA       AL            162    TEX       AL            162        6        4         60.0
171899  20161002               0         Sun    SDN       NL            162    ARI       NL            162        2        3         53.0
171900  20161002               0         Sun    DET       AL            161    ATL       NL            161        0        1         51.0
171901  20161002               0         Sun    CHN       NL            162    CIN       NL            162        7        4         54.0
171902  20161002               0         Sun    MIL       NL            162    COL       NL            162        6        4         60.0
171903  20161002               0         Sun    NYN       NL            162    PHI       NL            162        2        5         51.0
171904  20161002               0         Sun    LAN       NL            162    SFN       NL            162        1        7         51.0
171905  20161002               0         Sun    PIT       NL            162    SLN       NL            162        4       10         51.0
171906  20161002               0         Sun    MIA       NL            161    WAS       NL            162        7       10         51.0

In [109]:
pd.DataFrame(np.random.randn(3, 12))

,0,1,2,3,4,5,6,7,8,9,10,11
0,0.116211,0.247393,0.462065,0.331835,0.906233,0.405651,1.611538,0.068275,0.377707,1.314001,1.198042,-0.087064
1,1.056646,1.300047,-0.081029,0.713962,-1.578055,1.053586,-1.716723,0.084718,0.181338,0.211748,0.168981,-0.676513
2,-0.150781,-1.715333,0.686989,0.519197,-0.432590,0.070421,-1.573035,0.656502,0.104428,-0.597963,-0.093206,1.329506

In [112]:
pd.set_option('display.width', 40) # default is 80
pd.DataFrame(np.random.randn(3, 12))

,0,1,2,3,4,5,6,7,8,9,10,11
0,2.260860,2.084625,-0.530009,-1.427457,-1.806215,0.961151,0.029171,1.346059,-0.816722,-0.316666,-0.389906,-2.140342
1,-1.554464,-0.688023,0.475525,-0.230576,-2.831427,0.138499,0.797007,0.102345,-0.222169,0.189605,0.648083,0.537350
2,-0.022427,1.098532,0.847095,-1.413214,-0.417706,-0.016080,0.056465,0.186735,-0.119140,2.111516,0.364742,0.066273

## Panel
Panel is a somewhat less-used, but still important container for 3-dimensional data.

Warning In 0.20.0, Panel is deprecated and will be removed in a future version. See the section Deprecate Panel.

Over the last few years, pandas has increased in both breadth and depth, with new features, datatype support, and manipulation routines. As a result, supporting efficient indexing and functional routines for Series, DataFrame and Panel has contributed to an increasingly fragmented and difficult-to-understand codebase.

The 3-D structure of a Panel is much less common for many types of data analysis, than the 1-D of the Series or the 2-D of the DataFrame. Going forward it makes sense for pandas to focus on these areas exclusively.

Oftentimes, one can simply use a MultiIndex DataFrame for easily working with higher dimensional data.